Adicionando diagrama
